

. // Get GDP per capita data from the Penn World Tables, Version 9.0 (Feenstra 
> et al. 2015)
. // download from http://www.rug.nl/ggdc/docs/pwt90.dta
. 
. use pwt90.dta, clear

. gen gdppc = rgdpe/pop/1000
(2,391 missing values generated)

. drop if gdppc==.
(2,391 observations deleted)

. keep country year gdppc

. save pwt90_gdppc.dta, replace
file pwt90_gdppc.dta saved

. 
. // Get World Values Survey 6-wave data 
. // from http://www.worldvaluessurvey.org/WVSDocumentationWVL.jsp
. // generate variables of interest, merge in the PWT data, and save
. use WVS_Longitudinal_1981_2014_stata_v2015_04_18.dta, clear

. kountry S003, from(iso3n)

----------------------------------------
The command has finished.
The new variable is named NAMES_STD.
----------------------------------------

. rename NAMES_STD country

. gen year = S020

. gen religiosity = F063 if F063>0
(22,287 missing values generated)

. gen educ = X025 if X025>0
(45,129 missing values generated)

. keep country year religiosity educ

. 
. merge m:1 country year using pwt90_gdppc.dta
(note: variable country was str22, now str34 to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        62,617
        from master                    53,376  (_merge==1)
        from using                      9,241  (_merge==2)

    matched                           287,895  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(62,617 observations deleted)

. drop _merge

. save wvs_pwt.dta, replace
file wvs_pwt.dta saved

. 
. // Now merge these data *into* the SWIID
. use SWIIDv5_1.dta, clear
(SWIID v5.1, July 2016. Refer to the stata_swiid.pdf file for usage instruction
> s.)

. merge 1:m country year using wvs_pwt.dta
(note: variable country was str30, now str34 to accommodate using data's
       values)
(note: variable year was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        48,849
        from master                     3,914  (_merge==1)
        from using                     44,935  (_merge==2)

    matched                           242,960  (_merge==3)
    -----------------------------------------

. drop if _merge!=3
(48,849 observations deleted)

. drop _merge

. 
end of do-file
